"""
Задача 1
Направете функција која ќе ги испечати броевите од 1 до 10 користејќи for циклус.

Задача 2
Напишете функција која ќе ја пресмета сумата на броевите од 1 до n
(n го бира корисникот кога ќе ја повика функцијата) користејќи for циклус.

Задача 3
Напишете функција која броевите од 1 до 100 ќе ги подели во неколку листи:
1) Парни броеви
2) Непарни броеви
3) Броеви деливи со 3
4) Броеви деливи со 5
5) Броеви кои завршуваат на 7
Доколку некој број припаѓа во неколку групи, нека биде дел од сите листи.
На крајот испечатете ги сите листи.

Задача 4
Напишете функција која за даден збор ќе провери дали е палиндром или не.

Задача 5
Напишете функција која за дадена листа ќе го најде и испринта 2риот најголем елемент.
Не смее да се сортира листата за да се најде бројот.
Пример листа: [1, 17, 3, 5, 2, 10, 14, 13, 6, 20]

Задача 6
Напишете функција која за дадена листа од броеви, ќе пресмета и испечати производот
на секој пар броеви. 
Листа: 1, 2, 5, 6, 9, 10

Пример: 
    листа = [1, 2, 3]
    решение: 1 * 1 -> 1
             1 * 2 -> 2
             1 * 3 -> 3
             2 * 1 -> 2
             2 * 2 -> 4
             2 * 3 -> 6
             3 * 1 -> 3
             3 * 2 -> 6
             3 * 3 -> 9 
            

(Бонус) 
Задача 7
Напишете функција која ќе го пронајде н-тиот елемент на Фибоначиевата низа. 
Првиот елемент е 1, вториот елемент е 1, а секој нареден елемент се добива како збор 
од двата претходни елементи, пример третиот е 2, четвртиот е 3, итн. 


За секоја од задачите направете посебна функција и потоа во main функција повикајте ги сите.
За задачите каде што не ви се дадени конкретни вредности проверете ја задачата со 3 различни примери.
Решенијата генерирани со ChatGPT нема да се валидни како решена домашна. 
"""
'''
# Направете функција која ќе ги испечати броевите од 1 до 10 користејќи for циклус.
def do_deset():
    for i in range(1, 11):
        print(i)
do_deset()


#Задача 2
# Напишете функција која ќе ја пресмета сумата на броевите од 1 до n
# (n го бира корисникот кога ќе ја повика функцијата) користејќи for циклус.

def sum10():
    suma = 0
    n = int(input('Vnesi vrednost za n:'))
    for i in range(1, n+1):
        suma += i
    print(suma)
sum10()

# Задача 3
# Напишете функција која броевите од 1 до 100 ќе ги подели во неколку листи:
# 1) Парни броеви
# 2) Непарни броеви
# 3) Броеви деливи со 3
# 4) Броеви деливи со 5
# 5) Броеви кои завршуваат на 7
# Доколку некој број припаѓа во неколку групи, нека биде дел од сите листи.
# На крајот испечатете ги сите листи.
'''
def sto():
    parni = []
    neparni = []
    delivi_so_3 = []
    delivi_so_5 = []
    zavrsuvaat_7 = []
    for i in range(1, 101):
        if i % 2 == 0:
            parni.append(i)
        else:
            neparni.append(i)
        if i % 3 == 0:
            delivi_so_3.append(i)
        if i % 5 == 0:
            delivi_so_5.append(i)
        if i % 10 == 7:
            zavrsuvaat_7.append(i)
    print(f"parni = {parni}\nneparni = {neparni}\ndelivi_so_3 = {delivi_so_3}\ndelivi_so_5 ={delivi_so_5}\nzavrsuvaat_7 = {zavrsuvaat_7}")
sto()


# #Напишете функција која за даден збор ќе провери дали е палиндром или не.
# def palindrom():
#     zbor1 = input('Vnesi zbor: ')
#     zbor2 = zbor1[::-1]
#     if zbor1 == zbor2:
#         print(f'Zborot {zbor1} e palindrom.')
#     else:
#         print(f'Zborot {zbor1} ne e palindrom.')
# palindrom()



# Напишете функција која за дадена листа ќе го најде и испринта 2риот најголем елемент.
# Не смее да се сортира листата за да се најде бројот.
# Пример листа: [1, 17, 3, 5, 2, 10, 14, 13, 6, 20]
l2 = [1, 17, 3, 5, 2, 10, 14, 13, 6, 20]
def vtor_najgolem(l):
    vtor = najgolem = min(l2)
    for i in l2:
        if i > najgolem:
            vtor = najgolem
            najgolem = i
        elif i < najgolem and i > vtor:
            vtor = i
    print(f'Vtoriot najgolem broj vo listata e {vtor}.')
vtor_najgolem(l2)


#Напишете функција која за дадена листа од броеви, ќе пресмета и испечати производот на секој пар броеви.
#Листа: 1, 2, 5, 6, 9, 10
lis = [1, 2, 5, 6, 9, 10]
def proiz(l):
    proizvod = 1
    for i in l:
        for j in l:
            proizvod = i*j
            print(f'{i} * {j} = {proizvod}')
proiz(lis)

# Напишете функција која ќе го пронајде н-тиот елемент на Фибоначиевата низа.
# Првиот елемент е 1, вториот елемент е 1, а секој нареден елемент се добива како збор
# од двата претходни елементи, пример третиот е 2, четвртиот е 3, итн.
def fibonacci():
    fib = [1, 1]
    broj = int(input('Vnesi broj: '))
    for i in range(2, broj):
        fib.append(fib[i - 1] + fib[i - 2])
    print(fib[broj - 1])
fibonacci()
